var g_languages = [
    ["中文"//0
    ,"确 定"//1
    ,"取 消"//2
    ,"刷 新"//3
    ,"清缓存"//4
    ,"改密码"//5
    ,"保 存"//6
    ,"模式切换"//7
    ,"删 除"//8
    ,"登 录"//9
    ,"注 册"//10
    ,"返回登录"//11
    ,"移动网关"//12
    ,"用户登录"//13
    ,"用户名"//14
    ,"密码"//15
    ,"自动登录"//16
    ,"用户注册"//17
    ,"邀请码"//18
    ,"确认密码"//19
    ,"姓名"//20
    ,"联系电话"//21
    ,"邮箱"//22
    ,"用户协议"//23
    ,"必须填写邀请码"//24
    ,"描述"//25
    ,"基础信息"//26
    ,"发送 ↑ "//27
    ,"接收 ↓ "//28
    ,"总内存"//29
    ,"已用内存"//30
    ,"内存峰值"//31
    ,"状态"//32
    ,"在线"//33
    ,"离线"//34
    ,"系统状态"//35
    ,"工作线程"//36
    ,"空闲线程"//37
    ,"最大连接"//38
    ,"当前连接"//39
    ,"等待事件"//40
    ,"检测线程"//41
    ,"服务集合"//42
    ,"本地绑定"//43
    ,"路由指向"//44
    ,"协议"//45
    ,"远程IP"//46
    ,"远程端口"//47
    ,"服务端"//48
    ,"修改配置"//49
    ,"官方代理"//50
    ,"访问点配置"//51
    ,"访问点序号"//52
    ,"访问点名称"//53
    ,"访问点描述"//54
    ,"协商端口号"//55
    ,"输入小于64的数字..."//56
    ,"输入节点名..."//57
    ,"输入简短描述..."//58
    ,"协商端口号默认不指定..."//59
    ,"必须输入访问点序号，且为<64的整数"//60
    ,"更改密码"//61
    ,"旧密码"//62
    ,"新密码"//63
    ,"恭喜您：注册请求成功，请务必妥善保管你的服务ID"//64
    ,"登录失败，请验证输入的用户名密码！"//65
    ,"登录中..."//66
    ,"注册失败，请确认信息填写无误！"//67
    ,"密码修改失败！！"//68
    ,"请等待..."//69
    ,"注册中..."//70
    ,"必须输入原密码"//71
    ,"密码不能为空"//72
    ,"新密码不能和原密码相同"//73
    ,"确认密码不一致"//74
    ,"访问点名称不能为空，且长度<64"//75
    ,"访问点简要描述不能为空，且长度<64"//76
    ,"必须填写邀请码"//77
    ,"必须填写用户名"//78
    ,"必须设置密码"//79
    ,"必须设置确认密码，且确保与密码一致"//80
    ,"必须填写昵称"//81
    ,"你真的要删除当前配置的代理点吗？"//82
    ,"正在自动登录，请稍后..."//83
    ,"网络不可用，请确认网络设置"//84
    ,"端口"//85
    ,"服务端模式"//86
    ,"访问点"//87
    ,"待检测"//88
    ,"连接检测中..."//89
    ,"旧版本"//90
    ,"登录失败！用户不存在或密码错误"//91
    ,"密码修改成功！请妥善保管您的密"//92
    ,"密码修改成功！下次登录需重新输入新密码"//93
    ,"注册失败！邀请码有误"//94
    ,"密码修改失败，请稍后再试"//95
    ,"转发配置错误[本地端口需大于1024]"//96
    ,"转发端口配置错误[需小于65536]"//97
    ,"远程端口配置错误，范围[1-65535]"//98
    ,"转发配置错误[端口冲突]"//99
    ,"转发配置错误[未知错误]"//100
    ,"配置修改成功！将在下次重启时生效"//101
    ,"移动网关将保持提供服务"//102
    ,"服务启动时间"//103
    ,"暴露服务集"//104
    ,"服务端代理"//105
    ,"请选择文件操作："//106
    ,"上传"//107
    ,"下载"//108
    ,"文件管理"//109
    ,"文件名"//110
    ,"大小"//111
    ,"当前版本过低,不支持自动升级,请手动更新！"//112
    ,"自定义代理"//113
    ,"自定义代理 IP:port..."//114
    ,"访问Token"//115
    ,"代理服务器Token..."//116
    ,"P2P加密选项" //117
    ,"none"//118
    ,"first"//119
    ,"only"//120
    ,"序列号注册成功！"//121
    ,"序列号注册失败！"//122
    ,"序列号注册" //123
    ,"序列号" //124
    ,"必须输入序列号" //125
    ,"VIP 到期剩余时间（天）:" //126
    ,"播放" //127
    ,"已发送定位请求..." //128
    ,"定位请求失败" //129
    ,"已成功获取定位信息" //130
    ,"请输入账号"//131
    ,"请输入密码"//132
    ,"账号最短为 3 个字符"//133
    ,"密码长度至少为 6 个字符"//134
    ,"邀请码必须输入数字，且不为0"//135
    ,"邮箱地址格式错误"//136
    ,"请输入邀请码"//137
    ,"请确认密码"//138
    ,"请输入电话号码"//139
    ,"请输入邮箱"//140
    ,"注册成功后，请于2小时内完成首次登录，用户名、密码请妥善保管，用户相关数据仅存储于本地。"//141
    ,"密码两次输入不一致"//142
    ,"设置"//143
    ,"左滑可以打开设置"//144
    ,"设置完成后，即时生效，你可以右滑返回"//145
    ,"语言选择"//146
    ,"常用设置"//147
    ,"高级设置"//148
    ,"操作确认"//149
    ,"确认删除该条收藏记录？"//150
    ,"系统免费用户"//151
    ,"确认删除该条代理记录？"//152
    ,"添加映射配置"//153
    ,"注意：请仔细核对，如输入序列号错误，须等待半小时才能继续注册"//154
    ,"下拉可以刷新"//155
    ,"释放立即刷新"//156
    ,"正在刷新..."//157
    ,"提示信息"//158
    ,"错误信息"//159
    ,"常用收藏"//160
    ,"为常用连接提供收藏"//161
    ,"请输入收藏标题"//162
    ,"加入收藏"//163
    ,"文件传输功能只能在P2P或自定义代理生效时使用"//164
    ,"您暂时没有此功能权限"//165
    ,"目标文件夹"//166
    ,"当前文件夹"//167
    ,"任务区"//168
    ,"可点击切换文件主机"//169
    ,"刷新操作需要30秒间隔"//170
    ,"操作失败，条目可能已添加" //171
    ,"是否切换为服务端模式？"//172
    ,"切换服务端/客户端模式后，需要重启APP才能生效！" //173
    ,"请输入姓名"//174
    ,"请间隔30秒后再试！"//175
    ,"新用户注册失败！"//176
    ,"网络太慢，数据加载超时！"//177
    ,"确认删除当前选中文件？"//178
    ,"确认传输当前选中文件？"//179
    ,"玩命加载中..."//180
    ,"请自行申请百度地图浏览器版AK。如首次使用地图，请在配置中设置AK"//181
    ,"AK码设置"//182
    ,"请输入百度地图浏览器版AK码"//183
    ,"地图"//184
    ,"描述"//185
    ,"备注设置"//186
    ,"请输入服务简短备注"//187
    ,"设置[电池优化]"//188
    ,"设置后台[无限制]"//189
    ,"关闭应用速冻"//190
    ,"允许后台高耗电"//191
    ,"前往[电池优化]-[应用名称]，设置[不允许]"//192
    ,"设置MIUI系统后台配置为[无限制]"//193
    ,"前往[电池]-[应用名称]，关闭[后台冻结]和[检测到异常时自动优化]"//194
    ,"前往[电池]-[后台耗电管理]-[应用名称]，设置[允许后台高耗电]"//195
    ,"跳转设置失败"//196
    ,"未知机型，请自行设置后台运行权限"//197
    ,"展开"//198
    ,"收起"//199
    ,"浅色"//200
    ,"深色"//201
    ,"跟随系统"//202
    ,"主题模式"//203
    ],
    ["English"
    , "OK" //1
    , "Cancel" //2
    , "Refresh" //3
    , "Clear" //4
    , "Chpass" //5
    , "Save" //6
    , "Chmode" //7
    , "Delete" //8
    , "Login" //9
    , "Register" //10
    , "Back to login" //11
    , "SmarGate" //12
    , "User login" //13
    , "User name" //14
    , "Password" //15
    , "Auto login" //16
    , "User registration" //17
    , "Invitation NO" //18
    , "Confirm" //19
    , "Name" //20
    , "Phone NO" //21
    , "Mailbox" //22
    , "User Agreement" //23
    , "Invitation code must be filled in" //24
    , "Desc" //25
    , "Info" //26
    , "SND ↑ " //27
    , "RX ↓ " //28
    , "Tot-mem" //29
    , "Usage" //30
    , "Max-usage" //31
    , "Status" //32
    , "Online" //33
    , "Offline" //34
    , "Summery" //35
    , "Workers" //36
    , "Idles" //37
    , "Max-sockets" //38
    , "Connections" //39
    , "Pending" //40
    , "Products" //41
    , "Services" //42
    , "Local bind" //43
    , "Routing to" //44
    , "Protocol" //45
    , "Peer IP" //46
    , "Peer port" //47
    , "Server" //48
    , "Configure" //49
    , "Agent" //50
    , "Endpoint configuration" // 51
    , "Endpoint IDX"//52
    , "Endpoint name" // 53
    , "Endpoint Desc" // 54
    , "Negotiation port" //55
    , "Enter a number less than 64..." //56
    , "Enter node name..." //57
    , "Enter a short description..." //58
    , "No need specified by default..." //59
    , "The access point number must be entered and is an integer of <64" //60
    , "Change password" //61
    , "Older" //62
    , "Newer" //63
    , "Congratulations: registration request is successful. Please keep your service ID properly" //64
    , "Login failed. Please verify the user name password you entered!"// 65
    , "Logging in..." //66
    , "Registration failed. Please confirm that the information is filled in correctly!"// 67
    , "Password modification failed!!"// 68
    , "Please wait..." //69
    , "Registered..." //70
    , "Must enter original password" //71
    , "Password cannot be empty" //72
    , "New password cannot be the same as the original password" //73
    , "Confirm password is inconsistent" //74
    , "Endpoint name cannot be empty and length is <64" //75
    , "Endpoint brief description cannot be empty and length is <64" //76
    , "Invitation code must be filled in" //77
    , "User name must be filled in" //78
    , "Password must be set" //79
    , "Confirm password must be set and be sure to be consistent with password" //80
    , "Must fill in nickname" //81
    , "Do you really want to delete the currently configured proxy point?"// 82
    , "Logging in automatically, please wait..." //83
    , "Network not available, please confirm network settings "//84
    , "Port" //85
    , "Server mode" //86
    , "EP" // 87 Endpoint
    , "Waiting for detection" //88
    , "Connection detection..." //89
    , "Old version" //90
    , "Login failed! User does not exist or password error "//91
    , "Password modified successfully! Please keep your secret in good condition "//92
    , "Password modified successfully! The next login requires a new password to be re entered "//93
    , "Registration failed! Invitation code error "//94
    , "Password modification failed. Please try again later "//95
    , "Forwarding configuration error [local port needs to be greater than 1024]" //96
    , "Forward port configuration error [less than 65536]" //97
    , "Remote port configuration error, range [1-65535]" //98
    , "Forward configuration error [port conflict]" //99
    , "Forward configuration error [unknown error]" //100
    , "Configuration modification succeeded! Will take effect on the next reboot "//101
    , "The SmarGate will remain in service" // 102
    , "Service start time" // 103
    , "Exposed services"//104
    , "Server Proxy"//105
    , "Please select a file operation:"//106
    , "upload"//107
    , "download"//108
    , "File Manager" //109
    , "file name" //110
    , "size" //111
    , "The current version is too low to support automatic upgrade, please update manually!" //112
    , "User proxy"//113
    , "User proxy IP:port..."//114
    , "Access token"//115
    , "Token of proxy server..."//116
    , "SSL for P2P" //117
    , "none"//118
    , "first"//119
    , "only"//120
    , "Successful license register！"//121
    , "Fault to license register！"//122
    , "License register" //123
    , "License key" //124
    , "license key must be filled" //125
    , "VIP exp-after-days:" //126
    , "Play" //127
    , "Location request has been sent..." //128
    , "Location request failed" //129
    , "Successfully obtained location information" //130
    , "Please enter your account"//131
    , "Please enter password"//132
    , "The minimum account length is 3 characters"//133
    , "The password length should be at least 6 characters"//134
    , "The invitation code must be entered as a number and not 0"//135
    , "Email address format error"//136
    , "Please enter the invitation code"//137
    , "Please confirm password"//138
    , "Please enter a phone number"//139
    , "Please enter your email address"//140
    , "After successful registration, please complete the first login within 2 hours. Please keep your username and password properly, and user related data is only stored locally."//141
    , "The password entered twice is inconsistent"//142
    , "Setting"//143
    , "Left swipe to open settings"//144
    , "After setting up, you can slide right to return"//145
    , "Language "//146
    , "Common Settings"//147
    , "Advanced Setting"//148
    , "Operate Confirm"//149
    , "Are you sure to delete this favorite record?"//150
    , "You are free users"//151
    , "Confirm deleting the proxy record?"//152
    , "Add mapping configuration" //153
    , "Attention: Please check carefully. If you enter the wrong serial number, you will need to wait for half an hour before continuing to register"//154
    , "Dropdown can refresh"//155
    , "Release and refresh immediately"//156
    , "Refreshing..."//157
    , "Information"//158
    , "Error"//159
    , "Favorites"//160
    , "Provide favorites for commonly used connections"//161
    , "Please enter the bookmark title"//162
    , "Add to favorites"//163
    , "The file transfer function can only be used when P2P or custom proxies are in effect"//164
    , "You currently do not have permission for this feature"//165
    , "Destination Folder"//166
    , "Current Folder"//167
    , "Mission Area"//168
    , "Click to switch file hosts"//169
    , "The refresh operation requires a 30 second interval"//170
    , "Operation failed, entry may have been added"//171
    , "Switch to server-side mode?"//172
    , "After switching between server/client mode, you need to restart the app to take effect!"//173
    , "Please enter your name"//174
    , "Please try again after a 30 second interval"//175
    , "New user registration failed！"//176
    , "The network is too slow, data loading timed out!"//177
    , "Confirm deleting the currently selected file？"//178
    , "Confirm the transfer of the currently selected file？"//179
    , "Loading..."//180
    , "Please apply for Baidu Map Browser version AK by yourself. If using the map for the first time, please set AK in the configuration"//181
    , "AK code setting"//182
    , "Enter AK code of the Baidu Map"//183
    , "Map"//184
    , "MEMO"//185
    , "Notes modify"//186
    , "Enter notes of the services"//187
    , "Settings [Battery Optimization]"//188
    , "Set up background [unlimited]"//189
    , "Close application quick freeze"//190
    , "Allow high power consumption in the background"//191
    , "Go to [Battery Optimization]-[App Name] and set [Not Allowed]"//192
    , "Set the MIUI system background configuration to [Unlimited]"//193
    , "Go to [Battery]-[App Name], turn off [Background Freeze] and [Automatic Optimization when Abnormality Detected]"//194
    , "Go to [Battery]-[Background Power Consumption Management]-[App Name] and set [Allow background high power consumption]"//195
    , "Load setting failed"//196
    , "Unknown model, please set background running permissions yourself"//197
    ,"Expand"//198
    ,"Collapse"//199
    ,"Light"//200
    ,"Dark"//201
    ,"Auto"//202
    ,"Theme"//203
    ]
    ,
    ["فارسی"
    ,"تایید"//1
    ,"لغو"//2
    ,"تازه‌سازی"//3
    ,"پاک کردن"//4
    ,"تغییر رمز"//5
    ,"ذخیره"//6
    ,"تغییر حالت"//7
    ,"حذف"//8
    ,"ورود"//9
    ,"ثبت نام"//10
    ,"بازگشت به ورود"//11
    ,"SmarGate"//12
    ,"ورود کاربر"//13
    ,"نام کاربری"//14
    ,"رمز عبور"//15
    ,"ورود خودکار"//16
    ,"ثبت نام کاربر"//17
    ,"کد دعوت"//18
    ,"تایید رمز"//19
    ,"نام"//20
    ,"شماره تماس"//21
    ,"ایمیل"//22
    ,"قوانین کاربری"//23
    ,"کد دعوت الزامی است"//24
    ,"توضیحات"//25
    ,"اطلاعات"//26
    ,"ارسال ↑"//27
    ,"دریافت ↓"//28
    ,"کل حافظه"//29
    ,"مصرفی"//30
    ,"حداکثر مصرف"//31
    ,"وضعیت"//32
    ,"آنلاین"//33
    ,"آفلاین"//34
    ,"خلاصه"//35
    ,"کارگرها"//36
    ,"آزاد"//37
    ,"حداکثر سوکت"//38
    ,"اتصالات"//39
    ,"در انتظار"//40
    ,"محصولات"//41
    ,"سرویس‌ها"//42
    ,"اتصال محلی"//43
    ,"مسیریابی به"//44
    ,"پروتکل"//45
    ,"IP همتا"//46
    ,"پورت همتا"//47
    ,"سرور"//48
    ,"پیکربندی"//49
    ,"نماینده"//50
    ,"پیکربندی نقطه دسترسی"//51
    ,"شناسه نقطه"//52
    ,"نام نقطه"//53
    ,"توضیحات نقطه"//54
    ,"پورت مذاکره"//55
    ,"عددی کمتر از 64 وارد کنید..."//56
    ,"نام گره را وارد کنید..."//57
    ,"توضیح کوتاه وارد کنید..."//58
    ,"به طور پیش‌فرض نیازی به تعیین نیست..."//59
    ,"شماره نقطه دسترسی باید وارد شود و عدد صحیح کمتر از 64 باشد"//60
    ,"تغییر رمز عبور"//61
    ,"قدیمی"//62
    ,"جدید"//63
    ,"تبریک: درخواست ثبت نام موفقیت‌آمیز بود. لطفاً شناسه سرویس خود را به خوبی نگهداری کنید"//64
    ,"ورود ناموفق. لطفاً نام کاربری و رمز عبور را بررسی کنید!"//65
    ,"در حال ورود..."//66
    ,"ثبت نام ناموفق. لطفاً اطلاعات را به درستی تکمیل کنید!"//67
    ,"تغییر رمز عبور ناموفق!!"//68
    ,"لطفاً صبر کنید..."//69
    ,"در حال ثبت نام..."//70
    ,"رمز عبور قدیمی الزامی است"//71
    ,"رمز عبور نمی‌تواند خالی باشد"//72
    ,"رمز جدید نمی‌تواند با رمز قدیمی یکسان باشد"//73
    ,"تایید رمز عبور مطابقت ندارد"//74
    ,"نام نقطه دسترسی نمی‌تواند خالی باشد و طول آن کمتر از 64 است"//75
    ,"توضیح کوتاه نقطه دسترسی نمی‌تواند خالی باشد و طول آن کمتر از 64 است"//76
    ,"کد دعوت الزامی است"//77
    ,"نام کاربری الزامی است"//78
    ,"رمز عبور باید تنظیم شود"//79
    ,"تایید رمز عبور باید تنظیم شده و با رمز عبور مطابقت داشته باشد"//80
    ,"نام مستعار الزامی است"//81
    ,"آیا واقعاً می‌خواهید پروکسی پیکربندی شده فعلی را حذف کنید؟"//82
    ,"در حال ورود خودکار، لطفاً صبر کنید..."//83
    ,"شبکه در دسترس نیست، لطفاً تنظیمات شبکه را بررسی کنید"//84
    ,"پورت"//85
    ,"حالت سرور"//86
    ,"نقطه دسترسی"//87
    ,"در انتظار تشخیص"//88
    ,"در حال تشخیص اتصال..."//89
    ,"نسخه قدیمی"//90
    ,"ورود ناموفق! کاربر وجود ندارد یا رمز عبور اشتباه است"//91
    ,"رمز عبور با موفقیت تغییر کرد! لطفاً آن را به خوبی نگهداری کنید"//92
    ,"رمز عبور با موفقیت تغییر کرد! ورود بعدی نیاز به وارد کردن رمز جدید دارد"//93
    ,"ثبت نام ناموفق! کد دعوت اشتباه است"//94
    ,"تغییر رمز عبور ناموفق. لطفاً بعداً دوباره تلاش کنید"//95
    ,"خطای پیکربندی ارسال [پورت محلی باید بیشتر از 1024 باشد]"//96
    ,"خطای پیکربندی پورت ارسال [کمتر از 65536]"//97
    ,"خطای پیکربندی پورت راه دور، محدوده [1-65535]"//98
    ,"خطای پیکربندی ارسال [تداخل پورت]"//99
    ,"خطای پیکربندی ارسال [خطای ناشناخته]"//100
    ,"پیکربندی با موفقیت تغییر کرد! در راه‌اندازی بعدی اعمال خواهد شد"//101
    ,"SmarGate در حال ارائه سرویس باقی خواهد ماند"//102
    ,"زمان شروع سرویس"//103
    ,"سرویس‌های در معرض نمایش"//104
    ,"پروکسی سرور"//105
    ,"لطفاً عملیات فایل را انتخاب کنید:"//106
    ,"آپلود"//107
    ,"دانلود"//108
    ,"مدیریت فایل"//109
    ,"نام فایل"//110
    ,"اندازه"//111
    ,"نسخه فعلی برای پشتیبانی از به‌روزرسانی خودکار بسیار پایین است، لطفاً به صورت دستی به‌روزرسانی کنید!"//112
    ,"پروکسی کاربر"//113
    ,"IP:port پروکسی کاربر..."//114
    ,"توکن دسترسی"//115
    ,"توکن سرور پروکسی..."//116
    ,"SSL برای P2P"//117
    ,"هیچ"//118
    ,"اول"//119
    ,"فقط"//120
    ,"ثبت مجوز موفقیت‌آمیز!"//121
    ,"خطای ثبت مجوز!"//122
    ,"ثبت مجوز"//123
    ,"کلید مجوز"//124
    ,"کلید مجوز باید وارد شود"//125
    ,"VIP روزهای باقی‌مانده:"//126
    ,"پخش"//127
    ,"درخواست موقعیت مکانی ارسال شد..."//128
    ,"درخواست موقعیت مکانی ناموفق بود"//129
    ,"اطلاعات موقعیت مکانی با موفقیت دریافت شد"//130
    ,"لطفاً حساب کاربری خود را وارد کنید"//131
    ,"لطفاً رمز عبور را وارد کنید"//132
    ,"حداقل طول حساب کاربری 3 کاراکتر است"//133
    ,"طول رمز عبور باید حداقل 6 کاراکتر باشد"//134
    ,"کد دعوت باید به صورت عدد وارد شود و صفر نباشد"//135
    ,"خطای فرمت آدرس ایمیل"//136
    ,"لطفاً کد دعوت را وارد کنید"//137
    ,"لطفاً رمز عبور را تایید کنید"//138
    ,"لطفاً شماره تلفن را وارد کنید"//139
    ,"لطفاً ایمیل خود را وارد کنید"//140
    ,"پس از ثبت نام موفق، لطفاً اولین ورود را ظرف 2 ساعت انجام دهید. نام کاربری و رمز عبور خود را به خوبی نگهداری کنید، داده‌های کاربری فقط به صورت محلی ذخیره می‌شوند."//141
    ,"رمز عبور دو بار وارد شده مطابقت ندارد"//142
    ,"تنظیمات"//143
    ,"کشیدن به چپ برای باز کردن تنظیمات"//144
    ,"پس از تنظیم، می‌توانید به راست بکشید تا بازگردید"//145
    ,"انتخاب زبان"//146
    ,"تنظیمات عمومی"//147
    ,"تنظیمات پیشرفته"//148
    ,"تایید عملیات"//149
    ,"آیا از حذف این رکورد مورد علاقه اطمینان دارید؟"//150
    ,"شما کاربر رایگان هستید"//151
    ,"تایید حذف رکورد پروکسی؟"//152
    ,"افزودن پیکربندی نگاشت"//153
    ,"توجه: لطفاً به دقت بررسی کنید. اگر شماره سریال اشتباه وارد کنید، باید نیم ساعت قبل از ادامه ثبت نام صبر کنید"//154
    ,"کشیدن به پایین برای تازه‌سازی"//155
    ,"رها کردن برای تازه‌سازی فوری"//156
    ,"در حال تازه‌سازی..."//157
    ,"اطلاعات"//158
    ,"خطا"//159
    ,"علاقه‌مندی‌ها"//160
    ,"ارائه علاقه‌مندی برای اتصالات پرکاربرد"//161
    ,"لطفاً عنوان نشانک را وارد کنید"//162
    ,"افزودن به علاقه‌مندی‌ها"//163
    ,"عملکرد انتقال فایل فقط زمانی قابل استفاده است که P2P یا پروکسی سفارشی فعال باشد"//164
    ,"شما در حال حاضر مجوز این ویژگی را ندارید"//165
    ,"پوشه مقصد"//166
    ,"پوشه فعلی"//167
    ,"ناحیه ماموریت"//168
    ,"برای تغییر میزبان فایل کلیک کنید"//169
    ,"عملیات تازه‌سازی نیاز به فاصله 30 ثانیه دارد"//170
    ,"عملیات ناموفق، ورودی ممکن است قبلاً اضافه شده باشد"//171
    ,"آیا به حالت سرور تغییر کند؟"//172
    ,"پس از تغییر حالت سرور/کلاینت، باید برنامه را مجدداً راه‌اندازی کنید تا اعمال شود!"//173
    ,"لطفاً نام خود را وارد کنید"//174
    ,"لطفاً پس از 30 ثانیه دوباره تلاش کنید"//175
    ,"ثبت نام کاربر جدید ناموفق!"//176
    ,"سرعت شبکه بسیار پایین است، بارگذاری داده‌ها با خطای زمان مواجه شد!"//177
    ,"تایید حذف فایل انتخاب شده؟"//178
    ,"تایید انتقال فایل انتخاب شده؟"//179
    ,"در حال بارگذاری..."//180
    ,"لطفاً کلید AK نسخه مرورگر نقشه بایدو را خودتان درخواست دهید. اگر برای اولین بار از نقشه استفاده می‌کنید، لطفاً AK را در تنظیمات وارد کنید"//181
    ,"تنظیم کد AK"//182
    ,"کد AK نقشه بایدو را وارد کنید"//183
    ,"نقشه"//184
    ,"یادداشت"//185
    ,"ویرایش یادداشت"//186
    ,"یادداشت سرویس را وارد کنید"//187
    ,"تنظیمات [بهینه‌سازی باتری]"//188
    ,"تنظیم پس‌زمینه [نامحدود]"//189
    ,"بستن انجماد سریع برنامه"//190
    ,"اجازه مصرف بالای باتری در پس‌زمینه"//191
    ,"به [بهینه‌سازی باتری]-[نام برنامه] بروید و [مجاز نیست] را تنظیم کنید"//192
    ,"پیکربندی پس‌زمینه سیستم MIUI را روی [نامحدود] تنظیم کنید"//193
    ,"به [باتری]-[نام برنامه] بروید، [انجماد پس‌زمینه] و [بهینه‌سازی خودکار هنگام تشخیص خطا] را خاموش کنید"//194
    ,"به [باتری]-[مدیریت مصرف پس‌زمینه]-[نام برنامه] بروید و [اجازه مصرف بالای باتری در پس‌زمینه] را تنظیم کنید"//195
    ,"بارگذاری تنظیمات ناموفق"//196
    ,"مدل ناشناخته، لطفاً مجوزهای اجرای پس‌زمینه را خودتان تنظیم کنید"//197
    ,"باز کردن"//198
    ,"جمع کردن"//199
    ,"روشن"//200
    ,"تاریک"//201
    ,"خودکار"//202
    ,"پوسته"//203
    ]
    ,
    ["한국어"
    ,"확인"//1
    ,"취소"//2
    ,"새로고침"//3
    ,"지우기"//4
    ,"비밀번호 변경"//5
    ,"저장"//6
    ,"모드 전환"//7
    ,"삭제"//8
    ,"로그인"//9
    ,"회원가입"//10
    ,"로그인으로 돌아가기"//11
    ,"SmarGate"//12
    ,"사용자 로그인"//13
    ,"사용자 이름"//14
    ,"비밀번호"//15
    ,"자동 로그인"//16
    ,"사용자 등록"//17
    ,"초대 코드"//18
    ,"비밀번호 확인"//19
    ,"이름"//20
    ,"전화번호"//21
    ,"이메일"//22
    ,"사용자 약관"//23
    ,"초대 코드를 입력해야 합니다"//24
    ,"설명"//25
    ,"정보"//26
    ,"전송 ↑"//27
    ,"수신 ↓"//28
    ,"전체 메모리"//29
    ,"사용량"//30
    ,"최대 사용량"//31
    ,"상태"//32
    ,"온라인"//33
    ,"오프라인"//34
    ,"요약"//35
    ,"작업자"//36
    ,"유휴"//37
    ,"최대 소켓"//38
    ,"연결"//39
    ,"대기 중"//40
    ,"제품"//41
    ,"서비스"//42
    ,"로컬 바인드"//43
    ,"라우팅 대상"//44
    ,"프로토콜"//45
    ,"피어 IP"//46
    ,"피어 포트"//47
    ,"서버"//48
    ,"구성"//49
    ,"에이전트"//50
    ,"엔드포인트 구성"//51
    ,"엔드포인트 번호"//52
    ,"엔드포인트 이름"//53
    ,"엔드포인트 설명"//54
    ,"협상 포트"//55
    ,"64 미만의 숫자 입력..."//56
    ,"노드 이름 입력..."//57
    ,"간단한 설명 입력..."//58
    ,"기본적으로 지정할 필요 없음..."//59
    ,"액세스 포인트 번호를 입력해야 하며 64 미만의 정수여야 합니다"//60
    ,"비밀번호 변경"//61
    ,"이전 비밀번호"//62
    ,"새 비밀번호"//63
    ,"축하합니다: 등록 요청이 성공했습니다. 서비스 ID를 잘 보관하세요"//64
    ,"로그인 실패. 사용자 이름과 비밀번호를 확인하세요!"//65
    ,"로그인 중..."//66
    ,"등록 실패. 정보가 올바르게 입력되었는지 확인하세요!"//67
    ,"비밀번호 변경 실패!!"//68
    ,"잠시 기다려 주세요..."//69
    ,"등록 중..."//70
    ,"이전 비밀번호를 입력해야 합니다"//71
    ,"비밀번호는 비워둘 수 없습니다"//72
    ,"새 비밀번호는 이전 비밀번호와 같을 수 없습니다"//73
    ,"비밀번호 확인이 일치하지 않습니다"//74
    ,"엔드포인트 이름은 비워둘 수 없으며 길이는 64 미만입니다"//75
    ,"엔드포인트 간단 설명은 비워둘 수 없으며 길이는 64 미만입니다"//76
    ,"초대 코드를 입력해야 합니다"//77
    ,"사용자 이름을 입력해야 합니다"//78
    ,"비밀번호를 설정해야 합니다"//79
    ,"비밀번호 확인을 설정하고 비밀번호와 일치해야 합니다"//80
    ,"닉네임을 입력해야 합니다"//81
    ,"현재 구성된 프록시를 정말 삭제하시겠습니까?"//82
    ,"자동 로그인 중입니다. 잠시 기다려 주세요..."//83
    ,"네트워크를 사용할 수 없습니다. 네트워크 설정을 확인하세요"//84
    ,"포트"//85
    ,"서버 모드"//86
    ,"엔드포인트"//87
    ,"감지 대기 중"//88
    ,"연결 감지 중..."//89
    ,"이전 버전"//90
    ,"로그인 실패! 사용자가 존재하지 않거나 비밀번호 오류"//91
    ,"비밀번호가 성공적으로 변경되었습니다! 비밀번호를 잘 보관하세요"//92
    ,"비밀번호가 성공적으로 변경되었습니다! 다음 로그인 시 새 비밀번호를 입력해야 합니다"//93
    ,"등록 실패! 초대 코드 오류"//94
    ,"비밀번호 변경 실패. 나중에 다시 시도해 주세요"//95
    ,"전달 구성 오류 [로컬 포트는 1024보다 커야 함]"//96
    ,"전달 포트 구성 오류 [65536 미만]"//97
    ,"원격 포트 구성 오류, 범위 [1-65535]"//98
    ,"전달 구성 오류 [포트 충돌]"//99
    ,"전달 구성 오류 [알 수 없는 오류]"//100
    ,"구성 수정 성공! 다음 재부팅 시 적용됩니다"//101
    ,"SmarGate가 계속 서비스를 제공합니다"//102
    ,"서비스 시작 시간"//103
    ,"노출된 서비스"//104
    ,"서버 프록시"//105
    ,"파일 작업을 선택하세요:"//106
    ,"업로드"//107
    ,"다운로드"//108
    ,"파일 관리자"//109
    ,"파일 이름"//110
    ,"크기"//111
    ,"현재 버전이 자동 업데이트를 지원하기에 너무 낮습니다. 수동으로 업데이트하세요!"//112
    ,"사용자 프록시"//113
    ,"사용자 프록시 IP:port..."//114
    ,"액세스 토큰"//115
    ,"프록시 서버 토큰..."//116
    ,"P2P용 SSL"//117
    ,"없음"//118
    ,"처음"//119
    ,"만"//120
    ,"라이선스 등록 성공!"//121
    ,"라이선스 등록 실패!"//122
    ,"라이선스 등록"//123
    ,"라이선스 키"//124
    ,"라이선스 키를 입력해야 합니다"//125
    ,"VIP 남은 일수:"//126
    ,"재생"//127
    ,"위치 요청이 전송되었습니다..."//128
    ,"위치 요청 실패"//129
    ,"위치 정보를 성공적으로 가져왔습니다"//130
    ,"계정을 입력하세요"//131
    ,"비밀번호를 입력하세요"//132
    ,"계정 최소 길이는 3자입니다"//133
    ,"비밀번호 길이는 최소 6자 이상이어야 합니다"//134
    ,"초대 코드는 숫자로 입력해야 하며 0이 아니어야 합니다"//135
    ,"이메일 주소 형식 오류"//136
    ,"초대 코드를 입력하세요"//137
    ,"비밀번호를 확인하세요"//138
    ,"전화번호를 입력하세요"//139
    ,"이메일을 입력하세요"//140
    ,"등록 성공 후 2시간 이내에 첫 로그인을 완료하세요. 사용자 이름과 비밀번호를 잘 보관하세요. 사용자 데이터는 로컬에만 저장됩니다."//141
    ,"두 번 입력한 비밀번호가 일치하지 않습니다"//142
    ,"설정"//143
    ,"왼쪽으로 밀어 설정 열기"//144
    ,"설정 후 오른쪽으로 밀어 돌아가기"//145
    ,"언어 선택"//146
    ,"일반 설정"//147
    ,"고급 설정"//148
    ,"작업 확인"//149
    ,"이 즐겨찾기 기록을 삭제하시겠습니까?"//150
    ,"무료 사용자입니다"//151
    ,"프록시 기록을 삭제하시겠습니까?"//152
    ,"매핑 구성 추가"//153
    ,"주의: 신중하게 확인하세요. 잘못된 일련번호를 입력하면 등록을 계속하기 전에 30분을 기다려야 합니다"//154
    ,"아래로 당겨 새로고침"//155
    ,"놓아서 즉시 새로고침"//156
    ,"새로고침 중..."//157
    ,"정보"//158
    ,"오류"//159
    ,"즐겨찾기"//160
    ,"자주 사용하는 연결을 즐겨찾기에 추가"//161
    ,"북마크 제목을 입력하세요"//162
    ,"즐겨찾기에 추가"//163
    ,"파일 전송 기능은 P2P 또는 사용자 정의 프록시가 활성화된 경우에만 사용할 수 있습니다"//164
    ,"현재 이 기능에 대한 권한이 없습니다"//165
    ,"대상 폴더"//166
    ,"현재 폴더"//167
    ,"작업 영역"//168
    ,"클릭하여 파일 호스트 전환"//169
    ,"새로고침 작업은 30초 간격이 필요합니다"//170
    ,"작업 실패, 항목이 이미 추가되었을 수 있습니다"//171
    ,"서버 모드로 전환하시겠습니까?"//172
    ,"서버/클라이언트 모드 전환 후 앱을 재시작해야 적용됩니다!"//173
    ,"이름을 입력하세요"//174
    ,"30초 후에 다시 시도하세요"//175
    ,"새 사용자 등록 실패!"//176
    ,"네트워크가 너무 느립니다. 데이터 로딩 시간 초과!"//177
    ,"선택한 파일을 삭제하시겠습니까?"//178
    ,"선택한 파일을 전송하시겠습니까?"//179
    ,"로딩 중..."//180
    ,"바이두 지도 브라우저 버전 AK를 직접 신청하세요. 처음 지도를 사용하는 경우 구성에서 AK를 설정하세요"//181
    ,"AK 코드 설정"//182
    ,"바이두 지도의 AK 코드 입력"//183
    ,"지도"//184
    ,"메모"//185
    ,"메모 수정"//186
    ,"서비스 메모 입력"//187
    ,"설정 [배터리 최적화]"//188
    ,"백그라운드 [무제한] 설정"//189
    ,"앱 빠른 동결 닫기"//190
    ,"백그라운드 높은 전력 소비 허용"//191
    ,"[배터리 최적화]-[앱 이름]으로 이동하여 [허용 안 함] 설정"//192
    ,"MIUI 시스템 백그라운드 구성을 [무제한]으로 설정"//193
    ,"[배터리]-[앱 이름]으로 이동하여 [백그라운드 동결] 및 [이상 감지 시 자동 최적화] 끄기"//194
    ,"[배터리]-[백그라운드 전력 관리]-[앱 이름]으로 이동하여 [백그라운드 높은 전력 소비 허용] 설정"//195
    ,"설정 로드 실패"//196
    ,"알 수 없는 모델입니다. 백그라운드 실행 권한을 직접 설정하세요"//197
    ,"펼치기"//198
    ,"접기"//199
    ,"라이트"//200
    ,"다크"//201
    ,"자동"//202
    ,"테마"//203
    ]
    ,
    ["Русский"
    ,"ОК"//1
    ,"Отмена"//2
    ,"Обновить"//3
    ,"Очистить"//4
    ,"Сменить пароль"//5
    ,"Сохранить"//6
    ,"Сменить режим"//7
    ,"Удалить"//8
    ,"Вход"//9
    ,"Регистрация"//10
    ,"Вернуться ко входу"//11
    ,"SmarGate"//12
    ,"Вход пользователя"//13
    ,"Имя пользователя"//14
    ,"Пароль"//15
    ,"Автовход"//16
    ,"Регистрация пользователя"//17
    ,"Код приглашения"//18
    ,"Подтверждение"//19
    ,"Имя"//20
    ,"Телефон"//21
    ,"Эл. почта"//22
    ,"Соглашение"//23
    ,"Необходимо ввести код приглашения"//24
    ,"Описание"//25
    ,"Информация"//26
    ,"Отправлено ↑"//27
    ,"Получено ↓"//28
    ,"Всего памяти"//29
    ,"Использовано"//30
    ,"Макс. использование"//31
    ,"Статус"//32
    ,"Онлайн"//33
    ,"Офлайн"//34
    ,"Сводка"//35
    ,"Рабочие потоки"//36
    ,"Простаивающие"//37
    ,"Макс. сокетов"//38
    ,"Подключений"//39
    ,"Ожидание"//40
    ,"Продукты"//41
    ,"Сервисы"//42
    ,"Локальный бинд"//43
    ,"Маршрут к"//44
    ,"Протокол"//45
    ,"IP узла"//46
    ,"Порт узла"//47
    ,"Сервер"//48
    ,"Настроить"//49
    ,"Агент"//50
    ,"Конфигурация точки доступа"//51
    ,"Индекс точки"//52
    ,"Имя точки"//53
    ,"Описание точки"//54
    ,"Порт согласования"//55
    ,"Введите число менее 64..."//56
    ,"Введите имя узла..."//57
    ,"Введите краткое описание..."//58
    ,"По умолчанию не требуется..."//59
    ,"Необходимо ввести номер точки доступа — целое число <64"//60
    ,"Смена пароля"//61
    ,"Старый"//62
    ,"Новый"//63
    ,"Поздравляем: запрос на регистрацию успешен. Сохраните ваш ID сервиса"//64
    ,"Ошибка входа. Проверьте имя пользователя и пароль!"//65
    ,"Вход..."//66
    ,"Ошибка регистрации. Проверьте правильность заполнения данных!"//67
    ,"Ошибка смены пароля!!"//68
    ,"Пожалуйста, подождите..."//69
    ,"Регистрация..."//70
    ,"Необходимо ввести старый пароль"//71
    ,"Пароль не может быть пустым"//72
    ,"Новый пароль не должен совпадать со старым"//73
    ,"Подтверждение пароля не совпадает"//74
    ,"Имя точки доступа не может быть пустым, длина <64"//75
    ,"Краткое описание точки не может быть пустым, длина <64"//76
    ,"Необходимо ввести код приглашения"//77
    ,"Необходимо ввести имя пользователя"//78
    ,"Необходимо задать пароль"//79
    ,"Необходимо задать подтверждение пароля, совпадающее с паролем"//80
    ,"Необходимо ввести псевдоним"//81
    ,"Вы действительно хотите удалить текущий настроенный прокси?"//82
    ,"Выполняется автоматический вход, подождите..."//83
    ,"Сеть недоступна, проверьте настройки сети"//84
    ,"Порт"//85
    ,"Режим сервера"//86
    ,"Точка доступа"//87
    ,"Ожидание обнаружения"//88
    ,"Обнаружение соединения..."//89
    ,"Старая версия"//90
    ,"Ошибка входа! Пользователь не существует или неверный пароль"//91
    ,"Пароль успешно изменён! Храните его в безопасности"//92
    ,"Пароль успешно изменён! При следующем входе потребуется новый пароль"//93
    ,"Ошибка регистрации! Неверный код приглашения"//94
    ,"Ошибка смены пароля. Попробуйте позже"//95
    ,"Ошибка конфигурации пересылки [локальный порт должен быть >1024]"//96
    ,"Ошибка конфигурации порта пересылки [менее 65536]"//97
    ,"Ошибка конфигурации удалённого порта, диапазон [1-65535]"//98
    ,"Ошибка конфигурации пересылки [конфликт портов]"//99
    ,"Ошибка конфигурации пересылки [неизвестная ошибка]"//100
    ,"Конфигурация успешно изменена! Вступит в силу при следующем перезапуске"//101
    ,"SmarGate продолжит предоставление услуг"//102
    ,"Время запуска сервиса"//103
    ,"Открытые сервисы"//104
    ,"Серверный прокси"//105
    ,"Выберите операцию с файлом:"//106
    ,"Загрузить"//107
    ,"Скачать"//108
    ,"Файловый менеджер"//109
    ,"Имя файла"//110
    ,"Размер"//111
    ,"Текущая версия слишком стара для автоматического обновления, обновите вручную!"//112
    ,"Пользовательский прокси"//113
    ,"Пользовательский прокси IP:port..."//114
    ,"Токен доступа"//115
    ,"Токен прокси-сервера..."//116
    ,"SSL для P2P"//117
    ,"нет"//118
    ,"первый"//119
    ,"только"//120
    ,"Лицензия успешно зарегистрирована!"//121
    ,"Ошибка регистрации лицензии!"//122
    ,"Регистрация лицензии"//123
    ,"Лицензионный ключ"//124
    ,"Необходимо ввести лицензионный ключ"//125
    ,"VIP осталось дней:"//126
    ,"Воспроизвести"//127
    ,"Запрос местоположения отправлен..."//128
    ,"Ошибка запроса местоположения"//129
    ,"Местоположение успешно получено"//130
    ,"Введите аккаунт"//131
    ,"Введите пароль"//132
    ,"Минимальная длина аккаунта — 3 символа"//133
    ,"Длина пароля должна быть не менее 6 символов"//134
    ,"Код приглашения должен быть числом и не равен 0"//135
    ,"Неверный формат эл. почты"//136
    ,"Введите код приглашения"//137
    ,"Подтвердите пароль"//138
    ,"Введите номер телефона"//139
    ,"Введите эл. почту"//140
    ,"После успешной регистрации выполните первый вход в течение 2 часов. Сохраните имя пользователя и пароль — данные хранятся только локально."//141
    ,"Пароли, введённые дважды, не совпадают"//142
    ,"Настройки"//143
    ,"Свайп влево, чтобы открыть настройки"//144
    ,"После настройки свайпните вправо, чтобы вернуться"//145
    ,"Выбор языка"//146
    ,"Общие настройки"//147
    ,"Расширенные настройки"//148
    ,"Подтверждение операции"//149
    ,"Вы уверены, что хотите удалить эту запись из избранного?"//150
    ,"Вы бесплатный пользователь"//151
    ,"Подтвердите удаление записи прокси?"//152
    ,"Добавить конфигурацию сопоставления"//153
    ,"Внимание: проверьте внимательно. При неверном вводе серийного номера придётся ждать полчаса для продолжения регистрации"//154
    ,"Потяните вниз для обновления"//155
    ,"Отпустите для немедленного обновления"//156
    ,"Обновление..."//157
    ,"Информация"//158
    ,"Ошибка"//159
    ,"Избранное"//160
    ,"Добавление часто используемых подключений в избранное"//161
    ,"Введите название закладки"//162
    ,"Добавить в избранное"//163
    ,"Функция передачи файлов доступна только при активном P2P или пользовательском прокси"//164
    ,"У вас нет прав на эту функцию"//165
    ,"Целевая папка"//166
    ,"Текущая папка"//167
    ,"Область задач"//168
    ,"Нажмите для переключения файлового хоста"//169
    ,"Операция обновления требует интервала в 30 секунд"//170
    ,"Операция не удалась, запись, возможно, уже добавлена"//171
    ,"Переключиться в режим сервера?"//172
    ,"После переключения режима сервер/клиент необходимо перезапустить приложение!"//173
    ,"Введите ваше имя"//174
    ,"Повторите попытку через 30 секунд"//175
    ,"Ошибка регистрации нового пользователя!"//176
    ,"Сеть слишком медленная, время загрузки данных истекло!"//177
    ,"Подтвердите удаление выбранного файла?"//178
    ,"Подтвердите передачу выбранного файла?"//179
    ,"Загрузка..."//180
    ,"Пожалуйста, самостоятельно запросите AK для браузерной версии Baidu Maps. При первом использовании карты укажите AK в настройках"//181
    ,"Настройка кода AK"//182
    ,"Введите код AK Baidu Maps"//183
    ,"Карта"//184
    ,"Памятка"//185
    ,"Изменить памятку"//186
    ,"Введите краткую заметку о сервисе"//187
    ,"Настройки [Оптимизация батареи]"//188
    ,"Установить фон [Без ограничений]"//189
    ,"Отключить быструю заморозку приложения"//190
    ,"Разрешить высокое энергопотребление в фоне"//191
    ,"Перейдите в [Оптимизация батареи]-[Имя приложения] и установите [Запрещено]"//192
    ,"Установите фоновую конфигурацию MIUI в [Без ограничений]"//193
    ,"Перейдите в [Батарея]-[Имя приложения], отключите [Фоновую заморозку] и [Автооптимизацию при обнаружении аномалий]"//194
    ,"Перейдите в [Батарея]-[Управление фоновым энергопотреблением]-[Имя приложения] и установите [Разрешить высокое фоновое энергопотребление]"//195
    ,"Ошибка загрузки настроек"//196
    ,"Неизвестная модель, настройте разрешения фонового выполнения самостоятельно"//197
    ,"Развернуть"//198
    ,"Свернуть"//199
    ,"Светлая"//200
    ,"Тёмная"//201
    ,"Авто"//202
    ,"Тема"//203
    ]
  ];
